// Даны два числа. Показать большее и меньшее число
int numberA = 1;
int numberB = 2;
if (numberA > numberB)
{
    Console.Write("Самое большое число ");
    Console.Write(numberA);
    Console.WriteLine("Самое маленькое число ");
    Console.Write(numberB);
}
else
{
   Console.WriteLine("Самое большое число ");
    Console.WriteLine(numberB);
    Console.WriteLine("Cамое маленькое число ");
    Console.WriteLine(numberA); 
}